results/freebsd/concurrent_mid.txt
Running 1m test @ http://192.168.122.142:3000/concurrent
  8 threads and 200 connections
  Thread calibration: mean lat.: 911.306ms, rate sampling interval: 3620ms
  Thread calibration: mean lat.: 940.652ms, rate sampling interval: 3706ms
  Thread calibration: mean lat.: 901.954ms, rate sampling interval: 3602ms
  Thread calibration: mean lat.: 891.977ms, rate sampling interval: 3633ms
  Thread calibration: mean lat.: 911.431ms, rate sampling interval: 3694ms
  Thread calibration: mean lat.: 876.759ms, rate sampling interval: 3428ms
  Thread calibration: mean lat.: 899.775ms, rate sampling interval: 3606ms
  Thread calibration: mean lat.: 874.788ms, rate sampling interval: 3545ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.54s     3.76s   16.43s    56.84%
    Req/Sec   466.27     19.88   503.00     60.38%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.50s 
 75.000%   11.86s 
 90.000%   13.70s 
 99.000%   15.01s 
 99.900%   15.84s 
 99.990%   16.13s 
 99.999%   16.42s 
100.000%   16.44s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1547.263     0.000000            1         1.00
    3291.135     0.100000        18645         1.11
    4476.927     0.200000        37290         1.25
    6017.023     0.300000        55943         1.43
    7368.703     0.400000        74561         1.67
    8503.295     0.500000        93190         2.00
    9125.887     0.550000       102616         2.22
    9805.823     0.600000       111846         2.50
   10510.335     0.650000       121257         2.86
   11239.423     0.700000       130577         3.33
   11862.015     0.750000       139902         4.00
   12140.543     0.775000       144550         4.44
   12427.263     0.800000       149184         5.00
   12738.559     0.825000       153763         5.71
   13058.047     0.850000       158420         6.67
   13385.727     0.875000       163122         8.00
   13541.375     0.887500       165431         8.89
   13697.023     0.900000       167767        10.00
   13844.479     0.912500       170179        11.43
   13983.743     0.925000       172455        13.33
   14139.391     0.937500       174802        16.00
   14213.119     0.943750       175909        17.78
   14295.039     0.950000       177089        20.00
   14385.151     0.956250       178259        22.86
   14467.071     0.962500       179419        26.67
   14565.375     0.968750       180619        32.00
   14614.527     0.971875       181194        35.56
   14663.679     0.975000       181736        40.00
   14729.215     0.978125       182326        45.71
   14794.751     0.981250       182933        53.33
   14860.287     0.984375       183499        64.00
   14893.055     0.985938       183785        71.11
   14934.015     0.987500       184093        80.00
   14974.975     0.989062       184350        91.43
   15032.319     0.990625       184646       106.67
   15097.855     0.992188       184936       128.00
   15138.815     0.992969       185089       142.22
   15179.775     0.993750       185230       160.00
   15228.927     0.994531       185370       182.86
   15286.271     0.995313       185517       213.33
   15359.999     0.996094       185659       256.00
   15392.767     0.996484       185727       284.44
   15425.535     0.996875       185795       320.00
   15466.495     0.997266       185866       365.71
   15540.223     0.997656       185942       426.67
   15597.567     0.998047       186015       512.00
   15638.527     0.998242       186046       568.89
   15687.679     0.998437       186085       640.00
   15736.831     0.998633       186123       731.43
   15777.791     0.998828       186156       853.33
   15843.327     0.999023       186193      1024.00
   15859.711     0.999121       186209      1137.78
   15917.055     0.999219       186228      1280.00
   15941.631     0.999316       186247      1462.86
   15966.207     0.999414       186265      1706.67
   15998.975     0.999512       186285      2048.00
   16007.167     0.999561       186292      2275.56
   16031.743     0.999609       186303      2560.00
   16048.127     0.999658       186309      2925.71
   16064.511     0.999707       186326      3413.33
   16072.703     0.999756       186332      4096.00
   16072.703     0.999780       186332      4551.11
   16089.087     0.999805       186340      5120.00
   16097.279     0.999829       186343      5851.43
   16113.663     0.999854       186348      6826.67
   16130.047     0.999878       186353      8192.00
   16130.047     0.999890       186353      9102.22
   16138.239     0.999902       186355     10240.00
   16146.431     0.999915       186358     11702.86
   16154.623     0.999927       186359     13653.33
   16293.887     0.999939       186361     16384.00
   16310.271     0.999945       186362     18204.44
   16334.847     0.999951       186363     20480.00
   16383.999     0.999957       186366     23405.71
   16383.999     0.999963       186366     27306.67
   16392.191     0.999969       186369     32768.00
   16392.191     0.999973       186369     36408.89
   16392.191     0.999976       186369     40960.00
   16392.191     0.999979       186369     46811.43
   16392.191     0.999982       186369     54613.33
   16424.959     0.999985       186370     65536.00
   16424.959     0.999986       186370     72817.78
   16424.959     0.999988       186370     81920.00
   16433.151     0.999989       186371     93622.86
   16433.151     0.999991       186371    109226.67
   16433.151     0.999992       186371    131072.00
   16433.151     0.999993       186371    145635.56
   16433.151     0.999994       186371    163840.00
   16441.343     0.999995       186372    187245.71
   16441.343     1.000000       186372          inf
#[Mean    =     8537.270, StdDeviation   =     3760.199]
#[Max     =    16433.152, Total count    =       186372]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  225591 requests in 1.00m, 30.77MB read
Requests/sec:   3758.97
Transfer/sec:    524.93KB