results/freebsd/db_low.txt
Running 1m test @ http://192.168.122.142:3000/db
  4 threads and 50 connections
  Thread calibration: mean lat.: 2.951ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.949ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.944ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.944ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.96ms  444.62us  21.89ms   72.95%
    Req/Sec   535.60    106.56     1.44k    64.94%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.97ms
 75.000%    3.22ms
 90.000%    3.46ms
 99.000%    3.90ms
 99.900%    4.26ms
 99.990%   17.55ms
 99.999%   20.37ms
100.000%   21.90ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.053     0.000000            1         1.00
       2.439     0.100000        10017         1.11
       2.601     0.200000        20025         1.25
       2.737     0.300000        30035         1.43
       2.859     0.400000        39994         1.67
       2.969     0.500000        50073         2.00
       3.017     0.550000        55098         2.22
       3.067     0.600000        60112         2.50
       3.113     0.650000        64931         2.86
       3.163     0.700000        69977         3.33
       3.223     0.750000        74951         4.00
       3.255     0.775000        77465         4.44
       3.287     0.800000        79908         5.00
       3.327     0.825000        82506         5.71
       3.365     0.850000        84921         6.67
       3.409     0.875000        87441         8.00
       3.433     0.887500        88729         8.89
       3.457     0.900000        89933        10.00
       3.487     0.912500        91209        11.43
       3.517     0.925000        92406        13.33
       3.553     0.937500        93658        16.00
       3.573     0.943750        94273        17.78
       3.597     0.950000        94921        20.00
       3.625     0.956250        95542        22.86
       3.657     0.962500        96148        26.67
       3.693     0.968750        96771        32.00
       3.713     0.971875        97074        35.56
       3.735     0.975000        97397        40.00
       3.759     0.978125        97717        45.71
       3.789     0.981250        98017        53.33
       3.821     0.984375        98324        64.00
       3.843     0.985938        98496        71.11
       3.861     0.987500        98640        80.00
       3.883     0.989062        98791        91.43
       3.907     0.990625        98950       106.67
       3.931     0.992188        99109       128.00
       3.945     0.992969        99184       142.22
       3.961     0.993750        99258       160.00
       3.981     0.994531        99341       182.86
       4.001     0.995313        99420       213.33
       4.027     0.996094        99496       256.00
       4.041     0.996484        99535       284.44
       4.057     0.996875        99570       320.00
       4.075     0.997266        99615       365.71
       4.091     0.997656        99648       426.67
       4.111     0.998047        99692       512.00
       4.123     0.998242        99709       568.89
       4.135     0.998437        99727       640.00
       4.155     0.998633        99747       731.43
       4.179     0.998828        99767       853.33
       4.287     0.999023        99785      1024.00
       4.455     0.999121        99795      1137.78
       4.515     0.999219        99804      1280.00
       4.679     0.999316        99814      1462.86
       5.083     0.999414        99824      1706.67
       5.419     0.999512        99834      2048.00
       5.959     0.999561        99839      2275.56
       6.299     0.999609        99843      2560.00
       6.927     0.999658        99848      2925.71
       7.215     0.999707        99853      3413.33
       8.399     0.999756        99858      4096.00
      11.271     0.999780        99861      4551.11
      11.879     0.999805        99863      5120.00
      11.903     0.999829        99865      5851.43
      16.607     0.999854        99868      6826.67
      16.671     0.999878        99870      8192.00
      17.551     0.999890        99872      9102.22
      17.647     0.999902        99873     10240.00
      17.759     0.999915        99874     11702.86
      18.655     0.999927        99875     13653.33
      18.703     0.999939        99876     16384.00
      18.719     0.999945        99877     18204.44
      19.231     0.999951        99878     20480.00
      19.231     0.999957        99878     23405.71
      19.503     0.999963        99879     27306.67
      19.503     0.999969        99879     32768.00
      20.127     0.999973        99880     36408.89
      20.127     0.999976        99880     40960.00
      20.127     0.999979        99880     46811.43
      20.367     0.999982        99881     54613.33
      20.367     0.999985        99881     65536.00
      20.367     0.999986        99881     72817.78
      20.367     0.999988        99881     81920.00
      20.367     0.999989        99881     93622.86
      21.903     0.999991        99882    109226.67
      21.903     1.000000        99882          inf
#[Mean    =        2.964, StdDeviation   =        0.445]
#[Max     =       21.888, Total count    =        99882]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  119965 requests in 1.00m, 20.82MB read
Requests/sec:   1999.32
Transfer/sec:    355.35KB